dougg3/mac-rom-simm-programmer/hal/m258ke/nuvoton/rtc_reg.h
/**************************************************************************//**
 * @file     rtc_reg.h
 * @version  V1.00
 * @brief    RTC register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __RTC_REG_H__
#define __RTC_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
    @{
*/

/**
    @addtogroup RTC Real Time Clock Controller (RTC)
    Memory Mapped Structure for RTC Controller
    @{
*/

typedef struct
{


    /**
     * @var RTC_T::INIT
     * Offset: 0x00  RTC Initiation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |INIT_ACTIVE|RTC Active Status (Read Only)
     * |        |           |0 = RTC is at reset state.
     * |        |           |1 = RTC is at normal active state.
     * |[31:1]  |INIT       |RTC Initiation (Write Only)
     * |        |           |When RTC block is powered on, RTC is at reset state.
     * |        |           |User has to write a number (0xa5eb1357) to INIT to make RTC leave reset state.
     * |        |           |Once the INIT is written as 0xa5eb1357, the RTC will be in un-reset state permanently.
     * |        |           |The INIT is a write-only field and read value will be always 0.
     * @var RTC_T::FREQADJ
     * Offset: 0x08  RTC Frequency Compensation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[5:0]   |FRACTION   |Fraction Part
     * |        |           |Formula: FRACTION = (fraction part of detected value) X 64.
     * |        |           |Note: Digit in FCR must be expressed as hexadecimal number.
     * |[12:8]  |INTEGER    |Integer Part
     * |        |           |00000 = Integer part of detected value is 32752.
     * |        |           |00001 = Integer part of detected value is 32753.
     * |        |           |00010 = Integer part of detected value is 32754.
     * |        |           |00011 = Integer part of detected value is 32755.
     * |        |           |00100 = Integer part of detected value is 32756.
     * |        |           |00101 = Integer part of detected value is 32757.
     * |        |           |00110 = Integer part of detected value is 32758.
     * |        |           |00111 = Integer part of detected value is 32759.
     * |        |           |01000 = Integer part of detected value is 32760.
     * |        |           |01001 = Integer part of detected value is 32761.
     * |        |           |01010 = Integer part of detected value is 32762.
     * |        |           |01011 = Integer part of detected value is 32763.
     * |        |           |01100 = Integer part of detected value is 32764.
     * |        |           |01101 = Integer part of detected value is 32765.
     * |        |           |01110 = Integer part of detected value is 32766.
     * |        |           |01111 = Integer part of detected value is 32767.
     * |        |           |10000 = Integer part of detected value is 32768.
     * |        |           |10001 = Integer part of detected value is 32769.
     * |        |           |10010 = Integer part of detected value is 32770.
     * |        |           |10011 = Integer part of detected value is 32771.
     * |        |           |10100 = Integer part of detected value is 32772.
     * |        |           |10101 = Integer part of detected value is 32773.
     * |        |           |10110 = Integer part of detected value is 32774.
     * |        |           |10111 = Integer part of detected value is 32775.
     * |        |           |11000 = Integer part of detected value is 32776.
     * |        |           |11001 = Integer part of detected value is 32777.
     * |        |           |11010 = Integer part of detected value is 32778.
     * |        |           |11011 = Integer part of detected value is 32779.
     * |        |           |11100 = Integer part of detected value is 32780.
     * |        |           |11101 = Integer part of detected value is 32781.
     * |        |           |11110 = Integer part of detected value is 32782.
     * |        |           |11111 = Integer part of detected value is 32783.
     * |[31]    |FCRBUSY    |Frequency Compensation Register Write Operation Busy (Read Only) (only for M252_C/E)
     * |        |           |0 = The new register write operation is acceptable.
     * |        |           |1 = The last write operation is in progress and new register write operation prohibited.
     * |        |           |Note: This bit is only used when DCOMPEN(RTC_CLKFMT[16]) enabled.
     * @var RTC_T::TIME
     * Offset: 0x0C  RTC Time Loading Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:0]   |SEC        |1-Sec Time Digit (0~9)
     * |[6:4]   |TENSEC     |10-Sec Time Digit (0~5)
     * |[11:8]  |MIN        |1-Min Time Digit (0~9)
     * |[14:12] |TENMIN     |10-Min Time Digit (0~5)
     * |[19:16] |HR         |1-Hour Time Digit (0~9)
     * |[21:20] |TENHR      |10-Hour Time Digit (0~2)
     * |        |           |When RTC runs as 12-hour time scale mode, RTC_TIME[21] (the high bit of TENHR[1:0])
     * |        |           |means AM/PM indication (If RTC_TIME[21] is 1, it indicates PM time message.)
     * @var RTC_T::CAL
     * Offset: 0x10  RTC Calendar Loading Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:0]   |DAY        |1-Day Calendar Digit (0~9)
     * |[5:4]   |TENDAY     |10-Day Calendar Digit (0~3)
     * |[11:8]  |MON        |1-Month Calendar Digit (0~9)
     * |[12]    |TENMON     |10-Month Calendar Digit (0~1)
     * |[19:16] |YEAR       |1-Year Calendar Digit (0~9)
     * |[23:20] |TENYEAR    |10-Year Calendar Digit (0~9)
     * @var RTC_T::CLKFMT
     * Offset: 0x14  RTC Time Scale Selection Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |24HEN      |24-hour / 12-hour Time Scale Selection
     * |        |           |Indicates that RTC_TIME and RTC_TALM are in 24-hour time scale or 12-hour time scale.
     * |        |           |0 = 12-hour time scale with AM and PM indication selected.
     * |        |           |1 = 24-hour time scale selected.
     * |[16]    |DCOMPEN    |Dynamic Compensation Enable Bit (only for M252_C/E)
     * |        |           |0 = Dynamic Compensation Disabled.
     * |        |           |1 = Dynamic Compensation Enabled.
     * @var RTC_T::WEEKDAY
     * Offset: 0x18  RTC Day of the Week Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[2:0]   |WEEKDAY    |Day of the Week Register
     * |        |           |000 = Sunday.
     * |        |           |001 = Monday.
     * |        |           |010 = Tuesday.
     * |        |           |011 = Wednesday.
     * |        |           |100 = Thursday.
     * |        |           |101 = Friday.
     * |        |           |110 = Saturday.
     * |        |           |111 = Reserved.
     * @var RTC_T::TALM
     * Offset: 0x1C  RTC Time Alarm Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:0]   |SEC        |1-Sec Time Digit of Alarm Setting (0~9)
     * |[6:4]   |TENSEC     |10-Sec Time Digit of Alarm Setting (0~5)
     * |[11:8]  |MIN        |1-Min Time Digit of Alarm Setting (0~9)
     * |[14:12] |TENMIN     |10-Min Time Digit of Alarm Setting (0~5)
     * |[19:16] |HR         |1-Hour Time Digit of Alarm Setting (0~9)
     * |[21:20] |TENHR      |10-Hour Time Digit of Alarm Setting (0~2)
     * |        |           |When RTC runs as 12-hour time scale mode, RTC_TIME[21] (the high bit of TENHR[1:0])
     * |        |           |means AM/PM indication (If RTC_TIME[21] is 1, it indicates PM time message.)
     * @var RTC_T::CALM
     * Offset: 0x20  RTC Calendar Alarm Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:0]   |DAY        |1-Day Calendar Digit of Alarm Setting (0~9)
     * |[5:4]   |TENDAY     |10-Day Calendar Digit of Alarm Setting (0~3)
     * |[11:8]  |MON        |1-Month Calendar Digit of Alarm Setting (0~9)
     * |[12]    |TENMON     |10-Month Calendar Digit of Alarm Setting (0~1)
     * |[19:16] |YEAR       |1-Year Calendar Digit of Alarm Setting (0~9)
     * |[23:20] |TENYEAR    |10-Year Calendar Digit of Alarm Setting (0~9)
     * @var RTC_T::LEAPYEAR
     * Offset: 0x24  RTC Leap Year Indicator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |LEAPYEAR   |Leap Year Indication Register (Read Only)
     * |        |           |0 = This year is not a leap year.
     * |        |           |1 = This year is leap year.
     * @var RTC_T::INTEN
     * Offset: 0x28  RTC Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |ALMIEN     |Alarm Interrupt Enable Bit
     * |        |           |Set ALMIEN to 1 can also enable chip wake-up function when RTC alarm interrupt event is generated.
     * |        |           |0 = RTC Alarm interrupt Disabled.
     * |        |           |1 = RTC Alarm interrupt Enabled.
     * |[1]     |TICKIEN    |Time Tick Interrupt Enable Bit
     * |        |           |Set TICKIEN to 1 can also enable chip wake-up function when RTC tick interrupt event is generated.
     * |        |           |0 = RTC Time Tick interrupt Disabled.
     * |        |           |1 = RTC Time Tick interrupt Enabled.
     * |[8]     |TAMP0IEN   |Tamper 0 Interrupt Enable Bit
     * |        |           |Set TAMP0IEN to 1 can also enable chip wake-up function when tamper 0 interrupt event is generated.
     * |        |           |0 = Tamper 0 interrupt Disabled.
     * |        |           |1 = Tamper 0 interrupt Enabled.
     * @var RTC_T::INTSTS
     * Offset: 0x2C  RTC Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |ALMIF      |RTC Alarm Interrupt Flag
     * |        |           |0 = Alarm condition is not matched.
     * |        |           |1 = Alarm condition is matched.
     * |        |           |Note: Write 1 to clear this bit.
     * |[1]     |TICKIF     |RTC Time Tick Interrupt Flag
     * |        |           |0 = Tick condition does not occur.
     * |        |           |1 = Tick condition occur.
     * |        |           |Note: Write 1 to clear this bit.
     * |[8]     |TAMP0IF    |Tamper 0 Interrupt Flag
     * |        |           |0 = No Tamper 0 interrupt flag is generated.
     * |        |           |1 = Tamper 0 interrupt flag is generated.
     * |        |           |Note1: Write 1 to clear this bit.
     * @var RTC_T::TICK
     * Offset: 0x30  RTC Time Tick Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[2:0]   |TICK       |Time Tick Register
     * |        |           |These bits are used to select RTC time tick period for Periodic Time Tick Interrupt request.
     * |        |           |000 = Time tick is 1 second.
     * |        |           |001 = Time tick is 1/2 second.
     * |        |           |010 = Time tick is 1/4 second.
     * |        |           |011 = Time tick is 1/8 second.
     * |        |           |100 = Time tick is 1/16 second.
     * |        |           |101 = Time tick is 1/32 second.
     * |        |           |110 = Time tick is 1/64 second.
     * |        |           |111 = Time tick is 1/128 second.
     * @var RTC_T::TAMSK
     * Offset: 0x34  RTC Time Alarm Mask Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |MSEC       |Mask 1-Sec Time Digit of Alarm Setting (0~9)
     * |[1]     |MTENSEC    |Mask 10-Sec Time Digit of Alarm Setting (0~5)
     * |[2]     |MMIN       |Mask 1-Min Time Digit of Alarm Setting (0~9)
     * |[3]     |MTENMIN    |Mask 10-Min Time Digit of Alarm Setting (0~5)
     * |[4]     |MHR        |Mask 1-Hour Time Digit of Alarm Setting (0~9)
     * |[5]     |MTENHR     |Mask 10-Hour Time Digit of Alarm Setting (0~2)
     * @var RTC_T::CAMSK
     * Offset: 0x38  RTC Calendar Alarm Mask Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |MDAY       |Mask 1-Day Calendar Digit of Alarm Setting (0~9)
     * |[1]     |MTENDAY    |Mask 10-Day Calendar Digit of Alarm Setting (0~3)
     * |[2]     |MMON       |Mask 1-Month Calendar Digit of Alarm Setting (0~9)
     * |[3]     |MTENMON    |Mask 10-Month Calendar Digit of Alarm Setting (0~1)
     * |[4]     |MYEAR      |Mask 1-Year Calendar Digit of Alarm Setting (0~9)
     * |[5]     |MTENYEAR   |Mask 10-Year Calendar Digit of Alarm Setting (0~9)
     * @var RTC_T::SPRCTL
     * Offset: 0x3C  RTC Spare Functional Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |SPRCLRM    |Spare Register Clear Mask Bit
     * |        |           |0 = Spare register will be clear after TAMPER occur.
     * |        |           |1 = Spare register will not be clear after TAMPER occur.
     * |[2]     |SPRRWEN    |Spare Register Enable Bit
     * |        |           |0 = Spare register is Disabled.
     * |        |           |1 = Spare register is Enabled.
     * |        |           |Note: When spare register is disabled, RTC_SPR0 ~ RTC_SPR4 cannot be accessed.
     * |[5]     |SPRCSTS    |SPR Clear Flag
     * |        |           |This bit indicates if the RTC_SPR0 ~ RTC_SPR4 content is cleared when specify tamper event is detected.
     * |        |           |0 = Spare register content is not cleared.
     * |        |           |1 = Spare register content is cleared.
     * |        |           |Note1:Writes 1 to clear this bit.
     * |        |           |Note2:This bit keep 1 when RTC_INTSTS[8] is not equal to 0.
     * @var RTC_T::SPR
     * Offset: 0x40~0x50  RTC Spare Register 0/1/2/3/4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[31:0]  |SPARE      |Spare Register
     * |        |           |This field is used to store back-up information defined by user.
     * |        |           |This field will be cleared by hardware automatically once a tamper pin event is detected.
     * |        |           |Before storing back-up information in to RTC_SPRx register, user should check the register
     * |        |           |read/write enable bit SPRRWEN (RTC_SPRCTL[2]) is enabled.
     * @var RTC_T::LXTCTL
     * Offset: 0x100  RTC 32KHz Oscillator Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:1]   |GAIN       |Oscillator Gain Option
     * |        |           |User can select oscillator gain according to crystal external loading and operating temperature range.
     * |        |           |The larger gain value corresponding to stronger driving capability and higher power consumption.
     * |        |           |000 = L0 mode.
     * |        |           |001 = L1 mode.
     * |        |           |010 = L2 mode.
     * |        |           |011 = L3 mode.
     * |        |           |100 = L4 mode(Only for VBAT domain).
     * |        |           |101 = L5 mode(Only for VBAT domain).
     * |        |           |110 = L6 mode(Only for VBAT domain).
     * |        |           |111 = L7 mode(Only for VBAT domain).
     * |[7]     |C32KS      |RTC Clock 32K Source Selection:
     * |        |           |0 = Internal RTC clock is from 32K crystal .
     * |        |           |1 = Internal RTC clock is from LIRC.
     * |[8]     |IOCTLSEL   |IO Pin Backup Control Selection (Only for VBAT Domain)
     * |        |           |When low speed 32 kHz oscillator is disabled or TAMP0EN is disabled, PF.4 pin (X32KO pin), PF.5 pin (X32KI pin) or
     * |        |           |PF.6 pin (TAMPER0 pin) can be used as GPIO function.User can program IOCTLSEL to decide PF.4, 5, 6 I/O function
     * |        |           |is controlled by system power domain GPIO module or VBAT power domain RTC_GPIOCTL0 control register.
     * |        |           |0 = PF.4, 5, 6 pin I/O function is controlled by GPIO module.
     * |        |           |1 = PF.4, 5, 6 pin I/O function is controlled by VBAT power domain.
     * |        |           |Note1: IOCTLSEL will automatically be set by hardware to 1 when system power is off and RTC_GPIOCTL0 had been configured.
     * |        |           |Note2: The GPIO control feature is not supported when there is not any VBAT power domain.
     * |[13]    |RTCLVDPD   |RTC Low Voltage Detector Power Down (Only for VBAT domain)
     * |        |           |0= RTC Low Voltage Detector active..
     * |        |           |1= RTC Low Voltage Detector enter power down.
     * |[14]    |RTCPORPD   |RTC Power on Reset Power Down (Only for VBAT domain)
     * |        |           |0= RTC POR active 1sec after first power up.
     * |        |           |1= RTC POR enter power down.
     * |        |           |Note: This bit only can be set to 1.
     * @var RTC_T::GPIOCTL0
     * Offset: 0x104  RTC GPIO Control 0 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[1:0]   |OPMODE0    |IO Operation Mode(Only for VBAT domain)
     * |        |           |00 = PF.4 is input only mode.
     * |        |           |01 = PF.4 is output push pull mode.
     * |        |           |10 = PF.4 is open drain mode.
     * |        |           |11 = PF.4 is quasi-bidirectional mode.
     * |[2]     |DOUT0      |IO Output Data(Only for VBAT domain)
     * |        |           |0 = PF.4 output low.
     * |        |           |1 = PF.4 output high.
     * |[3]     |DINOFF0    |IO Pin Digital Input Path Disable Bit (Only for VBAT Domain)
     * |        |           |0 = PF.4 digital input path Enabled.
     * |        |           |1 = PF.4 digital input path Disabled (digital input tied to low).
     * |[5:4]   |PUSEL0     |IO Pull-up and Pull-down Enable Bits(Only for VBAT domain)
     * |        |           |Determine PF.4 I/O pull-up or pull-down.
     * |        |           |00 = PF.4 pull-up and pull-down disable.
     * |        |           |01 = PF.4 pull-up enable.
     * |        |           |10 = PF.4 pull-down enable.
     * |        |           |11 = PF.4 pull-up and pull-down disable.
     * |        |           |Note:Basically, the pull-up control and pull-down control has following behavior limitation.
     * |        |           |The independent pull-up / pull-down control register only valid when OPMODE0 set as input tri-state
     * |        |           |and open-drain mode.
     * |[6]     |SMTEN0     |Input Schmitt Trigger Enable Bit(Only for VBAT domain)
     * |        |           |0 = PF.4 input schmitt trigger function Disabled.
     * |        |           |1 = PF.4 input schmitt trigger function Enabled.
     * |[9:8]   |OPMODE1    |IO Operation Mode(Only for VBAT domain)
     * |        |           |00 = PF.5 is input only mode.
     * |        |           |01 = PF.5 is output push pull mode.
     * |        |           |10 = PF.5 is open drain mode.
     * |        |           |11 = PF.5 is quasi-bidirectional mode.
     * |[10]    |DOUT1      |IO Output Data(Only for VBAT domain)
     * |        |           |0 = PF.5 output low.
     * |        |           |1 = PF.5 output high.
     * |[11]    |DINOFF1    |IO Pin State Backup Selection(Only for VBAT domain)
     * |        |           |0 = PF.5 digital input path Enabled.
     * |        |           |1 = PF.5 digital input path Disabled (digital input tied to low).
     * |[13:12] |PUSEL1     |IO Pull-up and Pull-down Enable Bits(Only for VBAT domain)
     * |        |           |Determine PF.5 I/O pull-up or pull-down.
     * |        |           |00 = PF.5 pull-up and pull-down disable.
     * |        |           |01 = PF.5 pull-up enable.
     * |        |           |10 = PF.5 pull-down enable.
     * |        |           |11 = PF.5 pull-up and pull-down disable.
     * |        |           |Note:Basically, the pull-up control and pull-down control has following behavior limitation.
     * |        |           |The independent pull-up / pull-down control register only valid when OPMODE1 set as input tri-state
     * |        |           |and open-drain mode.
     * |[14]    |SMTEN1     |Input Schmitt Trigger Enable Bit(Only for VBAT domain)
     * |        |           |0 = PF.5 input schmitt trigger function Disabled.
     * |        |           |1 = PF.5 input schmitt trigger function Enabled.
     * |[17:16] |OPMODE2    |IO Operation Mode(Only for VBAT domain)
     * |        |           |00 = PF.6 is input only mode.
     * |        |           |01 = PF.6 is output push pull mode.
     * |        |           |10 = PF.6 is open drain mode.
     * |        |           |11 = PF.6 is quasi-bidirectional mode.
     * |[18]    |DOUT2      |IO Output Data(Only for VBAT domain)
     * |        |           |0 = PF.6 output low.
     * |        |           |1 = PF.6 output high.
     * |[19]    |DINOFF2    |IO Pin Digital Input Path Disable Bit (Only for VBAT Domain)
     * |        |           |0 = PF.6 input schmitt trigger function Disabled.
     * |        |           |1 = PF.6 input schmitt trigger function Enabled.
     * |[21:20] |PUSEL2     |IO Pull-up and Pull-down Enable Bits(Only for VBAT domain)
     * |        |           |Determine PF.6 I/O pull-up or pull-down.
     * |        |           |00 = PF.6 pull-up and pull-down disable.
     * |        |           |01 = PF.6 pull-up enable.
     * |        |           |10 = PF.6 pull-down enable.
     * |        |           |11 = PF.6 pull-up and pull-down disable.
