dougg3/mac-rom-simm-programmer/hal/m258ke/nuvoton/rtc_reg.h
     * |        |           |Note:Basically, the pull-up control and pull-down control has following behavior limitation.
     * |        |           |The independent pull-up / pull-down control register only valid when OPMODE2 set as input tri-state
     * |        |           |and open-drain mode and PF6 as tamper pin.
     * |[22]    |SMTEN2     |Input Schmitt Trigger Enable Bit(Only for VBAT domain)
     * |        |           |0 = PF.6 input schmitt trigger function Disabled.
     * |        |           |1 = PF.6 input schmitt trigger function Enabled.
     * @var RTC_T::DSTCTL
     * Offset: 0x110  RTC Daylight Saving Time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[0]     |ADDHR      |Add 1 Hour
     * |        |           |0 = No effect.
     * |        |           |1 = RTC hour digit has been added one hour for summer time change.
     * |[1]     |SUBHR      |Subtract 1 Hour
     * |        |           |0 = No effect.
     * |        |           |1 = RTC hour digit has been subtracted one hour for winter time change.
     * |[2]     |DSBAK      |Daylight Saving Back
     * |        |           |0= Normal mode.
     * |        |           |1= Daylight saving mode.
     * @var RTC_T::TAMPCTL
     * Offset: 0x120  RTC Tamper Pin Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[8]     |TAMP0EN    |Tamper0 Detect Enable Bit
     * |        |           |0 = Tamper 0 detect Disabled.
     * |        |           |1 = Tamper 0 detect Enabled.
     * |        |           |Note: The reference is RTC-clock. Tamper detector need sync 2 ~ 3 RTC-clock.
     * |[9]     |TAMP0LV    |Tamper 0 Level
     * |        |           |This bit depend on level attribute of tamper pin for static tamper detection.
     * |        |           |0 = Detect Rising detection, will trigger tamper status when RTC_TAMPCTL[11] = 1.
     * |        |           |Detect voltage level should be low. High will trigger tamper status when RTC_TAMPCTL[11] = 0.
     * |        |           |1 = Detect Falling detection, will trigger tamper status when RTC_TAMPCTL[11] = 1.
     * |        |           |Detect voltage level shoulld be high. Low will trigger tamper status when RTC_TAMPCTL[11] = 0.
     * |[10]    |TAMP0DBEN  |Tamper 0 De-bounce Enable Bit
     * |        |           |0 = Tamper 0 de-bounce Disabled.
     * |        |           |1 = Tamper 0 de-bounce Enabled.
     * |        |           |Note: In normal condition (25'C), it can deglitch 1~2 ns noise.
     * |[11]    |TAMP0TYPE  |Tamper 0 Detect Type
     * |        |           |0 = Tamper as edge detector.
     * |        |           |1 = Tamper as Level detector.
     * @var RTC_T::TAMPTIME
     * Offset: 0x130  RTC Tamper Time Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:0]   |SEC        |1-Sec Time Digit of TAMPER Time (0~9)
     * |[6:4]   |TENSEC     |10-Sec Time Digit of TAMPER Time (0~5)
     * |[11:8]  |MIN        |1-Min Time Digit of TAMPER Time (0~9)
     * |[14:12] |TENMIN     |10-Min Time Digit of TAMPER Time (0~5)
     * |[19:16] |HR         |1-Hour Time Digit of TAMPER Time (0~9)
     * |[21:20] |TENHR      |10-hour Time Digit of TAMPER Time (0~2)
     * |        |           |Note: 24-hour time scale only.
     * @var RTC_T::TAMPCAL
     * Offset: 0x134  RTC Tamper Calendar Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[3:0]   |DAY        |1-Day Calendar Digit of TAMPER Calendar (0~9)
     * |[5:4]   |TENDAY     |10-Day Calendar Digit of TAMPER Calendar (0~3)
     * |[11:8]  |MON        |1-Month Calendar Digit of TAMPER Calendar (0~9)
     * |[12]    |TENMON     |10-Month Calendar Digit of TAMPER Calendar (0~1)
     * |[19:16] |YEAR       |1-Year Calendar Digit of TAMPER Calendar (0~9)
     * |[23:20] |TENYEAR    |10-Year Calendar Digit of TAMPER Calendar (0~9)
     */
    __IO uint32_t INIT;                  /*!< [0x0000] RTC Initiation Register                                          */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE0[1];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t FREQADJ;               /*!< [0x0008] RTC Frequency Compensation Register                              */
    __IO uint32_t TIME;                  /*!< [0x000c] RTC Time Loading Register                                        */
    __IO uint32_t CAL;                   /*!< [0x0010] RTC Calendar Loading Register                                    */
    __IO uint32_t CLKFMT;                /*!< [0x0014] RTC Time Scale Selection Register                                */
    __IO uint32_t WEEKDAY;               /*!< [0x0018] RTC Day of the Week Register                                     */
    __IO uint32_t TALM;                  /*!< [0x001c] RTC Time Alarm Register                                          */
    __IO uint32_t CALM;                  /*!< [0x0020] RTC Calendar Alarm Register                                      */
    __I  uint32_t LEAPYEAR;              /*!< [0x0024] RTC Leap Year Indicator Register                                 */
    __IO uint32_t INTEN;                 /*!< [0x0028] RTC Interrupt Enable Register                                    */
    __IO uint32_t INTSTS;                /*!< [0x002c] RTC Interrupt Status Register                                    */
    __IO uint32_t TICK;                  /*!< [0x0030] RTC Time Tick Register                                           */
    __IO uint32_t TAMSK;                 /*!< [0x0034] RTC Time Alarm Mask Register                                     */
    __IO uint32_t CAMSK;                 /*!< [0x0038] RTC Calendar Alarm Mask Register                                 */
    __IO uint32_t SPRCTL;                /*!< [0x003c] RTC Spare Functional Control Register                            */
    __IO uint32_t SPR[5];                /*!< [0x0040 ~ 0x0050] RTC Spare Register 0 ~ 4                                */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE1[43];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t LXTCTL;                /*!< [0x0100] RTC 32KHz Oscillator Control Register                            */
    __IO uint32_t GPIOCTL0;              /*!< [0x0104] RTC GPIO Control 0 Register                                      */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE2[2];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t DSTCTL;                /*!< [0x0110] RTC Daylight Saving Time Control Register                        */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE3[3];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t TAMPCTL;               /*!< [0x0120] RTC Tamper Pin Control Register                                  */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE4[3];
    /// @endcond //HIDDEN_SYMBOLS
    __I  uint32_t TAMPTIME;              /*!< [0x0130] RTC Tamper Time Register                                         */
    __I  uint32_t TAMPCAL;               /*!< [0x0134] RTC Tamper Calendar Register                                     */
} RTC_T;

/**
    @addtogroup RTC_CONST RTC Bit Field Definition
    Constant Definitions for RTC Controller
@{ */

#define RTC_INIT_ACTIVE_Pos              (0)                                               /*!< RTC_T::INIT: INIT_ACTIVE Position      */
#define RTC_INIT_ACTIVE_Msk              (0x1ul << RTC_INIT_ACTIVE_Pos)                    /*!< RTC_T::INIT: INIT_ACTIVE Mask          */

